bench/v0.2-cuda/results/vllm__M1__c16__r1.bench.log
INFO 05-03 06:23:09 [nixl_utils.py:20] Setting UCX_RCACHE_MAX_UNRELEASED to '1024' to avoid a rare memory leak in UCX when using NIXL.
WARNING 05-03 06:23:09 [nixl_utils.py:34] NIXL is not available
WARNING 05-03 06:23:09 [nixl_utils.py:44] NIXL agent config is not available
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f68a12d2de0>, trust_remote_code=False, seed=0, num_prompts=64, dataset_name='custom', no_stream=False, dataset_path='/workspace/ferrum-infer-rs/bench/v0.2-cuda/prompts.jsonl', no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url='http://127.0.0.1:8800', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=16, model='/workspace/models/M1', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/workspace/ferrum-infer-rs/bench/v0.2-cuda/results', result_filename='vllm__M1__c16__r1.json', ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-7f69241d-', top_p=1.0, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 16
100%|██████████| 64/64 [00:20<00:00,  3.18it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     64        
Failed requests:                         0         
Maximum request concurrency:             16        
Benchmark duration (s):                  20.12     
Total input tokens:                      19046     
Total generated tokens:                  15330     
Request throughput (req/s):              3.18      
Output token throughput (tok/s):         762.10    
Peak output token throughput (tok/s):    896.00    
Peak concurrent requests:                30.00     
Total token throughput (tok/s):          1708.92   
---------------Time to First Token----------------
Mean TTFT (ms):                          239.46    
Median TTFT (ms):                        260.06    
P99 TTFT (ms):                           520.15    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          19.24     
Median TPOT (ms):                        18.80     
P99 TPOT (ms):                           29.24     
---------------Inter-token Latency----------------
Mean ITL (ms):                           18.74     
Median ITL (ms):                         17.99     
P99 ITL (ms):                            37.34     
==================================================